<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CategoriesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('categories')->insert([
            [
                'name' => "Опитувальник генералізованого тривожного розладу",                
                'type' => "(GAD-7)",
                'short_description' => "Використовується в діагностиці генералізованого тривожного розладу і інших станів, що супроводжуються тривогою.",
                'full_description' => "Як часто за останні 2 тижні Вас турбували наступні проблеми? Виберіть відповідну відповідь.",
            ],
            [
                'name' => "Шкала оцінки потреби у досягненні",
                'type' => "",
                'short_description' => "Мотивація досягнення - прагнення до поліпшення результатів, незадоволеність досягнутим, наполегливість у досягненні своїх цілей,
                прагнення домогтися свого будь-що-будь - є одним з головних властивостей особистості, що впливають на всю людське життя.",
                'full_description' => "Численні дослідження показали тісний зв'язок між рівнем мотивації досягнення
                і успіхом в життєдіяльності. І це не випадково, бо доведено, що люди, що володіють високим рівнем цієї самої мотивації, шукають ситуації
                досягнення, впевнені в успішному результаті, шукають інформацію для судження про свої успіхи, готові прийняти на себе відповідальність, рішучі в невизначених ситуаціях, виявляють наполегливість у прагненні до мети, отримують задоволення
                від рішення цікавих завдань, не губляться у ситуації змагання, показують велику завзятість  при зіткненні з перешкодами.
                Виміряти рівень мотивації досягнення можна за допомогою розробленої шкали - невеликого тесту опитувальника. Шкала ця складається з 22 суджень, з приводу яких можливі 2 варіанти
                відповідей - «так» чи «ні». Відповіді, що збігаються з ключовими (за кодом), підсумовуються (по 1 балу за кожен такий відповідь).",
            ],
            [
                'name' => "Шкала оцінки мотиваціх схвалення",
                'type' => "",
                'short_description' => "Рівень мотивації схвалення - прагнення заслужити схвалення значущих оточуючих людей - набагато менше визначає успіх в справах і звершеннях.",
                'full_description' => "Однак досить істотно впливає вона на щось інше, також дуже важливе - на якість взаємин з іншими людьми взагалі і зі своїм майбутнім супутником життя зокрема.
                Визначити рівень мотивації схвалення ми пропонуємо за допомогою сполученого варіанту шкали Д. Крауна і Д. Марлоу, що складається з 19 суджень, на які можливі 2 варіанти відповідей -
                «так» чи «ні». Відповіді, що збігаються з ключем, кодуються в 1 бал. Загальна сума (min = 0, max = 19) говорить про вираженість мотивації схвалення",
            ],
          /*  [
                'name' => "",
                'type' => "",
                'short_description' => "",
                'full_description' => "",
            ],
            */        ]);
    }
}
