<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CategoriesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('categories')->insert([
            [
                'name' => "Загальна обізнаність",
                'type' => "Вербальна частина",
                'short_description' => "Діагностує рівень простих знань",
                'full_description' => "Субетест «Загальна обізнаність» - включає 29 питань. Діагностує рівень простих знань. Немає питань, що потребують спеціальних і теоретичних знань. Правильна відповідь оцінюється в 1 бал. 2. Субетест «Розуміння»: 14 завдань на розуміння сенсу виразів. Оцінюється здатність до суджень. Оцінка в залежності від правильності відповіді: 0, 1, 2 бали.",
            ],
            [
                'name' => "Тямущість",
                'type' => "Вербальна частина",
                'short_description' => "Характеризує загальну інтелігентність випробуваного",
                'full_description' => "Субтест характеризує загальну інтелігентність випробуваного, практично не змінюються з віком і при старінні. Вважають, що вони визначаються рівнем освіти випробуваних.",
            ],
            [
                'name' => "Арифметика",
                'type' => "Вербальна частина",
                'short_description' => "Діагностує знання арифметики початкової школи",
                'full_description' => "Субтест «Арифметичний» діагностує як рівень оперування числовим матеріалом, але і довільну концентрацію уваги. Результати його виконання залежать від професії та рівня освіти і мало змінюються при старінні.",
            ],
            [
                'name' => "Подібність",
                'type' => "Вербальна частина",
                'short_description' => "Діагностує здатність до логічного мислення, узагальнення і абстрагування",
                'full_description' => "Результати його виконання говорять про здатність до логічного мислення, узагальнення і абстрагування. Оцінки по тесту погіршуються при старінні. Ймовірно, успішність його виконання більш визначається «текучим» інтелектом по Кеттела, ніж успішність виконання інших субтестів вербальної шкали.",
            ],
            [
                'name' => "Запам'ятовування цифр",
                'type' => "Вербальна частина",
                'short_description' => "Тест на пам'ять",
                'full_description' => "Субетест «Запам'ятовування цифр» - 1 - а частина містить ряди, в яких від 3 до 9 цифр. Випробуваний повинен прослухати цифри і усно їх відтворити. 2 - а частина включає ряди від 2 до 8 цифр. Випробуваний повинен відтворити ряд зворотним порядком.",
            ],
            [
                'name' => "Словниковий запас",
                'type' => "Вербальна частина",
                'short_description' => "Тест спрямований на вивчення вербального досвіду і вміння визначати поняття",
                'full_description' => "Субетест «Словниковий запас» - 42 поняття. Тест спрямований на вивчення вербального досвіду і вміння визначати поняття. Випробуваний повинен пояснити значення слова. Перші 10 слів - поширені в повсякденній мові, наступні 20 слів - середньої складності, останні 12 слів - абстрактно-теоретичні поняття. Оцінка від 0 до 2 балів.",
            ],
            [
                'name' => "Шифровка",
                'type' => "Невербальна шкала",
                'short_description' => "Діагностується візуально - моторна швидкість",
                'full_description' => "Потрібно написати під кожною цифрою (усього 100) відповідний символ за 1,5 хвилини. Наведено ключ: під кожної з 9 цифр відповідний символ. Діагностується візуально - моторна швидкість. Оцінка визначається числом правильно зашифрованих цифр.",
            ],
            [
                'name' => "Відсутні деталі",
                'type' => "Невербальна шкала",
                'short_description' => "Діагностує зорову спостережливість і здатність виявляти істотні ознаки",
                'full_description' => "«Відсутні деталі» (або «Завершення картинок») - 21 картка, на яких зображені картинки з відсутньої деталлю. Діагностує зорову спостережливість і здатність виявляти істотні ознаки. Час рішення одного завдання - 20 сек. Правильна відповідь оцінюється 1 балом.",
            ],
            [
                'name' => "Кубики Косса",
                'type' => "Невербальна шкала",
                'short_description' => "Діагностуються рухова координація і візуальний синтез",
                'full_description' => "«Конструювання блоків» ( «Кубики Косса») - 40 завдань. Включає набір карток з червоно-білими кресленнями і набір червоно - білих кубиків. Випробуваний повинен, дивлячись на зразок, зібрати з кубиків креслення. Діагностуються рухова координація і візуальний синтез. Оцінюється точність і час вирішення.",
            ],
            [
                'name' => "Послідовні картинки",
                'type' => "Невербальна шкала",
                'short_description' => "Діагностуються здатності організації цілого з частин, розуміння ситуації, екстраполяції",
                'full_description' => "«Послідовні картинки» - 8 серій картинок. Кожна серія являє сюжет. Картинки пред'являються в певній неправильної послідовності. Випробуваний повинен їх правильно розташувати. Діагностуються здатності організації цілого з частин, розуміння ситуації, екстраполяції. Оцінка визначається правильністю і часом рішення.",
            ],
            [
                'name' => "Складання фігур",
                'type' => "Невербальна шкала",
                'short_description' => "Діагностується здатність до синтезу цілого з деталей",
                'full_description' => "«Збірка об'єкта» ( «Складання фігур») - 4 завдання. Випробуваний повинен зібрати фігуру добре знайомого предмета з окремих деталей (фігури «людина», «профіль», «рука», «слон»). Діагностується здатність до синтезу цілого з деталей. Оцінка залежить від часу і правильності складання.",
            ],
        ]);
    }
}
