<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CategoriesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('categories')->insert([
            [
                'name' => "Опитувальник генералізованого тривожного розладу",                
                'type' => "(GAD-7)",
                'short_description' => "Використовується в діагностиці генералізованого тривожного розладу і інших станів, що супроводжуються тривогою.",
                'full_description' => "Як часто за останні 2 тижні Вас турбували наступні проблеми? Виберіть відповідну відповідь.",
            ],
            [
                'name' => "Діагностика рівня алекситимии",
                'type' => "(Торонтський алексіміческая шкала)",
                'short_description' => "Термін « алекситимия » походить від давньогрецького слова, буквально означає «без слів для почуттів».",
                'full_description' => "Алекситимия - це психологічна властивість особистості, пов'язане з труднощами:
                у визначенні та описі власних емоцій і емоцій інших людей;
                труднощами в розрізненні емоцій і тілесних відчуттів;
                зниженні здатності до символізації, зокрема до фантазії;
                фокусуванні переважно на зовнішніх подіях, на шкоду внутрішнім переживанням;
                схильність до конкретного, утилітарному, логічного мислення при дефіциті емоційних реакцій.
                Всі перераховані особливості можуть виявлятися в рівній мірі або одна з них може переважати.
                Вкажіть, в якій мірі ви згодні або не згодні з кожним з наступних тверджень.",
            ],
          /*  [
                'name' => "",
                'type' => "",
                'short_description' => "",
                'full_description' => "",
            ],
            */        ]);
    }
}
