<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ResultSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('results')->insert([
            [
                'categories_id' => "1",                
                'from' => 0,
                'to' => 4,
                'text' => "Все в порядку. У вас немає проблем з тривогою. Якщо ви турбуєтеся час від часу - це нормально, це життя.",
            ],
            [
                'categories_id' => "1",                
                'from' => 5,
                'to' => 9,
                'text' => "Тривога слабкому ступені. Люди, які набирають стільки ж балів, як і ви, стикаються з деякими проявами тривоги. Це може бути ситуативно (пов'язано з якоюсь конкретною ситуацією в вашому житті), тоді це пройде, коли ситуація вирішиться. Якщо не пройде або посилиться, будь ласка, зверніться за допомогою до психолога або психотерапевта.",
            ],
            [
                'categories_id' => "1",                
                'from' => 10,
                'to' => 14 ,
                'text' => "Тривога середнього ступеня. Повинно бути, ви помітно тривожитеся: по кільком найрізноманітніших приводів, начебто фінансів, здоров'я або відносин, або по якомусь одному конкретному приводу. Якщо тривога знижує якість вашого життя, будь ласка, зверніться за допомогою до психотерапевта.",
            ],
            [
                'categories_id' => "1",                
                'from' => 15,
                'to' => 21,
                'text' => "Тривога сильному ступені. Люди, які набирали стільки ж балів, як і ви, відчувають сильну тривогу більшу частину часу. Тривога може бути щодо «всього взагалі» або щодо якоїсь конкретної сфери (наприклад, фінанси або здоров'я). Це виснажує і знижує якість життя. Будь ласка, зверніться за допомогою до психотерапевта.",
            ],
            [
                'categories_id' => "2",                
                'from' => 0,
                'to' => 11,
                'text' => "Ваш рівень мотивації досягнення - низький.",
            ],
            [
                'categories_id' => "2",                
                'from' => 12,
                'to' => 15,
                'text' => "Рівень мотивації досягнення- середній.",
            ],
            [
                'categories_id' => "2",                
                'from' => 16,
                'to' => 22,
                'text' => "Рівень мотивації досягнення - високий.",
            ],
            [
                'categories_id' => "3",                
                'from' => 0,
                'to' => 19,
                'text' => "Ваш результат говорить про вираженість мотивації схвалення",
            ],
            ]);
    }
}
