<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class TestSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('questions')->insert([
            ['question' => "Почуття тривоги, неспокою, нервовості, бути на межі.", 'type' => "test", "categories_id" => "1"],
            ['question' => "Чи не в змозі припинити тривогу або контролювати її.", 'type' => "test", "categories_id" => "1"],
            ['question' => "Занадто багато тривоги і занепокоєння про різні речі і ситуаціях.", 'type' => "test", "categories_id" => "1"],
            ['question' => "Складно або неможливо розслабитися.", 'type' => "test", "categories_id" => "1"],
            ['question' => "Таке сильне занепокоєння, що важко всидіти на місці.", 'type' => "test", "categories_id" => "1"],
            ['question' => "Легко дратуюся або виходжу з себе.", 'type' => "test", "categories_id" => "1"],
            ['question' => "Почуття, що може трапитися щось жахливе.", 'type' => "test", "categories_id" => "1"],

            //8
            ['question' => "Думаю, що успіх в житті швидше за все залежить від випадку, ніж від розрахунку.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Якщо я втрачу улюбленого заняття, життя для мене втратить будь-який сенс.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Для мене в будь-якій справі важливіше не його виконання, а кінцевий результат.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Вважаю, що люди більше страждають від невдач на роботі, ніж від поганих взаємин з рідними.", 'type' => "test", "categories_id" => "2"],
            ['question' => "На мою думку, більшість людей живуть далекими цілями, а не близькими.", 'type' => "test", "categories_id" => "2"],
            ['question' => "У житті у мене було більше успіхів, ніж невдач.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Емоційні люди мені подобаються більше, ніж діяльні.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Навіть у звичайній роботі я намагаюся удосконалювати деякі її елементи.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Цілком Зайнятий думками про успіх, я можу забути про запобіжні заходи.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Мої близькі вважають мене ледачим.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Думаю, що в моїх невдачах винні скоріше всього обставини, ніж я сам.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Терпіння в мені більше, ніж здібностей.", 'type' => "test", "categories_id" => "2"],
            ['question' => " Мої батьки занадто суворо контролювали мене.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Лінь, а не сумнів в успіх змушує мене часто відмовлятися від своїх намірів.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Думаю, що я впевнений в собі людина.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Заради успіху я можу ризикнути, навіть якщо шанси невеликі.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Я старанний чоловік.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Коли все йде гладко, моя енергія посилююється.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Якби я був журналістом, я писав би скоріш всього про оригінальні винаходи людей, ніж про події.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Мої близькі зазвичай не поділяють моїх планів.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Рівень моїх вимог до життя нижчий, ніж у моїх товаришів.", 'type' => "test", "categories_id" => "2"],
            ['question' => "Мені здається, що наполегливості в мене більше, ніж здібностей.", 'type' => "test", "categories_id" => "2"],

            ['question' => "Я уважно читаю кожну книгу, перш ніж повернути її в бібліотеку.", 'type' => "test", "categories_id" => "3"],
            ['question' => "Я не відчуваю коливань, коли кому-небудь потрібно допомогти в біді.", 'type' => "test", "categories_id" => "3"],
            ['question' => "Я завжди уважно стежу за тим, як я одягнений.", 'type' => "test", "categories_id" => "3"],
            ['question' => "Вдома я веду себе за столом так само, як в їдальні.", 'type' => "test", "categories_id" => "3"],
            ['question' => "Я ніколи ні до кого не відчував антипатії.", 'type' => "test", "categories_id" => "3"],
            ['question' => "Був (і) випадок (і), коли я кинув щось робити,тому що не був упевнений в своїх силах.", 'type' => "test", "categories_id" => "3"],
            ['question' => "Іноді я люблю позлословити про відсутніх.", 'type' => "test", "categories_id" => "3"],
            ['question' => "Я завжди уважно слухаю співрозмовника, хто б він не був.", 'type' => "test", "categories_id" => "3"],
            ['question' => "Був випадок, коли я придумав вагому причину, щоб виправдатися.", 'type' => "test", "categories_id" => "3"],
            ['question' => "Чи траплялося, я користувався помилкою людини.", 'type' => "test", "categories_id" => "3"],
            ['question' => "Іноді замість того, щоб пробачити людину, я намагаюся відплатити йому тим же.", 'type' => "test", "categories_id" => "3"],
            ['question' => "Були випадки, коли я наполягав на тому, щоб робили по-моєму.", 'type' => "test", "categories_id" => "3"],
            ['question' => "У мене не виникає внутрішнього протесту, коли мене просять надати послугу.", 'type' => "test", "categories_id" => "3"],
            ['question' => "У мене ніколи не виникає досади, коли висловлюють думку, протилежне моєму.", 'type' => "test", "categories_id" => "3"],
            ['question' => "Перед тривалою поїздкою я завжди ретельно продумую, що з собою взяти.", 'type' => "test", "categories_id" => "3"],
            ['question' => "Були випадки, коли я заздрив удачі інших.", 'type' => "test", "categories_id" => "3"],
            ['question' => "Іноді мене дратують люди, які звертаються до мене з проханням.", 'type' => "test", "categories_id" => "3"],
            ['question' => "Коли у людей неприємності, я іноді думаю, що вони отримали по заслугах.", 'type' => "test", "categories_id" => "3"],
            ['question' => "Я ніколи з посмішкою не говорив неприємних речей.", 'type' => "test", "categories_id" => "3"],
            //49
            //[ 'question' => "", 'type' => "test", "categories_id" => "3"],


        ]);
    }
}
